---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.BendFailures.NotBentRefLine
source: html/f3dfbaab-e479-1ded-8d64-ac51910ae607.htm
---
# Autodesk.Revit.DB.BuiltInFailures.BendFailures.NotBentRefLine Property

While making curved beam type "[Type Name]" some Reference Line elements were not created

## Syntax (C#)
```csharp
public static FailureDefinitionId NotBentRefLine { get; }
```